FIRST STEP DATA CLEANING AND PREPARING THE DATASET

IMPORTING ALL THE REQUIRED LIBRARIES

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

IMPORTING ALL THE DATASET

In [34]:
students_df = pd.read_csv(r'C:\Users\theja\Desktop\SOHAN K\NEW ASSESMENT DA\students.csv')
activity_df = pd.read_csv(r'C:\Users\theja\Desktop\SOHAN K\NEW ASSESMENT DA\course_activity.csv')
feedback_df = pd.read_csv(r'C:\Users\theja\Desktop\SOHAN K\NEW ASSESMENT DA\feedback.csv')

ENSURING THE NULL VALUE AND DATASET DETAILS

In [35]:
students_df.info()
students_df.head()
students_df.isnull().sum()
students_df.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Student_ID      100 non-null    object
 1   Name            100 non-null    object
 2   Age             100 non-null    int64
 3   Gender          100 non-null    object
 4   Location        100 non-null    object
 5   Enrolment_Date  100 non-null    object
dtypes: int64(1), object(5)
memory usage: 4.8+ KB

np.int64(0)

In [36]:
activity_df.info()
activity_df.head()
activity_df.isnull().sum()
activity_df.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 659 entries, 0 to 658
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Student_ID             659 non-null    object
 1   Course_ID              659 non-null    object
 2   Date                   659 non-null    object
 3   Time_Spent_Minutes     659 non-null    int64
 4   Completion_Percentage  659 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 25.9+ KB

np.int64(0)

In [37]:
feedback_df.info()
feedback_df.head()
feedback_df.isnull().sum()
feedback_df.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student_ID     80 non-null     object
 1   Course_ID      80 non-null     object
 2   Rating         80 non-null     int64
 3   Feedback_Text  80 non-null     object
dtypes: int64(1), object(3)
memory usage: 2.6+ KB

np.int64(0)

In [ ]:
import pandas as pd

students_df = pd.read_csv(r'C:\Users\theja\Desktop\SOHAN K\NEW ASSESMENT DA\students.csv')

students_df.head()

  Student_ID       Name  Age  Gender   Location Enrolment_Date
0       S001  Student_1   24  Female    Kolkata     24/11/2023
1       S002  Student_2   32   Other    Chennai     27/02/2023
2       S003  Student_3   28   Other     Mumbai     13/01/2023
3       S004  Student_4   25  Female  Bangalore     21/05/2023
4       S005  Student_5   24   Other      Delhi     06/05/2023

CONVERTING THE DATA TYPE

In [41]:
students_df['Enrolment_Date'] = pd.to_datetime(students_df['Enrolment_Date'], dayfirst=True)

In [42]:
students_df.head()

  Student_ID       Name  Age  Gender   Location Enrolment_Date
0       S001  Student_1   24  Female    Kolkata     2023-11-24
1       S002  Student_2   32   Other    Chennai     2023-02-27
2       S003  Student_3   28   Other     Mumbai     2023-01-13
3       S004  Student_4   25  Female  Bangalore     2023-05-21
4       S005  Student_5   24   Other      Delhi     2023-05-06

In [43]:
course_df = pd.read_csv(r'C:\Users\theja\Desktop\SOHAN K\NEW ASSESMENT DA\course_activity.csv')
course_df.head()

  Student_ID Course_ID        Date  Time_Spent_Minutes  Completion_Percentage
0       S001     PY202  05/01/2024                  90                  46.10
1       S001     DM101  28/01/2024                 155                  88.87
2       S001     UX303  28/01/2024                 177                  54.93
3       S002     PY202  03/02/2024                  45                  32.20
4       S002     UX303  15/03/2024                 119                  90.80

In [44]:
course_df.info()
course_df.describe()
course_df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 659 entries, 0 to 658
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Student_ID             659 non-null    object
 1   Course_ID              659 non-null    object
 2   Date                   659 non-null    object
 3   Time_Spent_Minutes     659 non-null    int64
 4   Completion_Percentage  659 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 25.9+ KB

Student_ID               0
Course_ID                0
Date                     0
Time_Spent_Minutes       0
Completion_Percentage    0
dtype: int64

In [45]:
course_df['Date'] = pd.to_datetime(course_df['Date'], dayfirst=True)

In [46]:
feedback_df = pd.read_csv(r'C:\Users\theja\Desktop\SOHAN K\NEW ASSESMENT DA\feedback.csv')
feedback_df.head()

  Student_ID Course_ID  Rating       Feedback_Text
0       S057     UX303       2      Too fast-paced
1       S063     PY202       2  Loved the examples
2       S022     PY202       4     Could be better
3       S011     PY202       5   Needs improvement
4       S073     WD404       4     Could be better

In [47]:
feedback_df.info()
feedback_df.isnull().sum()
feedback_df['Rating'].value_counts()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student_ID     80 non-null     object
 1   Course_ID      80 non-null     object
 2   Rating         80 non-null     int64
 3   Feedback_Text  80 non-null     object
dtypes: int64(1), object(3)
memory usage: 2.6+ KB

Rating
1    19
4    18
5    15
3    15
2    13
Name: count, dtype: int64

SECOND STEP IS IMPLEMENTING EXPLORATORY DATA ANALYSIS (EDA) PROCESS

1.What is the overall average completion rate across courses?

In [ ]:

overall_avg_completion = course_df['Completion_Percentage'].mean()
print(f"The Overall Average Completion Rate: {overall_avg_completion:.2f}%")

The Overall Average Completion Rate: 54.78%

2.Which course has the highest and lowest average engagement time?

In [ ]:

avg_time_per_course = course_df.groupby('Course_ID')['Time_Spent_Minutes'].mean().sort_values(ascending=False)

print("Course with Highest Avg Engagement Time:")
print(avg_time_per_course.head(1))

print("\nCourse with Lowest Avg Engagement Time:")
print(avg_time_per_course.tail(1))

Course with Highest Avg Engagement Time:
Course_ID
DM101    102.427673
Name: Time_Spent_Minutes, dtype: float64

Course with Lowest Avg Engagement Time:
Course_ID
PY202    93.902439
Name: Time_Spent_Minutes, dtype: float64

3.How does engagement differ by age group or location?

In [ ]:

#defining age groups
bins = [0, 18, 25, 35, 50, 100]
labels = ['<18', '18-25', '26-35', '36-50', '50+']
students_df['Age_Group'] = pd.cut(students_df['Age'], bins=bins, labels=labels)

In [51]:
merged_df = pd.merge(course_df, students_df, on='Student_ID')

In [ ]:
engagement_by_age = merged_df.groupby('Age_Group', observed=False)['Time_Spent_Minutes'].mean()
engagement_by_location = merged_df.groupby('Location', observed=False)['Time_Spent_Minutes'].mean().sort_values(ascending=False)

In [53]:
# Engagement by Age Group
engagement_by_age = merged_df.groupby('Age_Group')['Time_Spent_Minutes'].mean()
print("Engagement by Age Group:")
print(engagement_by_age)

# Engagement by Location
engagement_by_location = merged_df.groupby('Location')['Time_Spent_Minutes'].mean().sort_values(ascending=False)
print("\nTop 5 Locations by Engagement:")
print(engagement_by_location.head(5))

Engagement by Age Group:
Age_Group
<18      107.102041
18-25     99.675958
26-35     95.362229
36-50           NaN
50+             NaN
Name: Time_Spent_Minutes, dtype: float64

Top 5 Locations by Engagement:
Location
Kolkata      104.384615
Delhi        103.302857
Bangalore     98.000000
Mumbai        95.435484
Chennai       90.946746
Name: Time_Spent_Minutes, dtype: float64

C:\Users\theja\AppData\Local\Temp\ipykernel_19656\723405005.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  engagement_by_age = merged_df.groupby('Age_Group')['Time_Spent_Minutes'].mean()

4.what is the average feedback rating per course?

In [ ]:

avg_rating_per_course = feedback_df.groupby('Course_ID')['Rating'].mean().sort_values(ascending=False)
print("Average Feedback Rating per Course:")
print(avg_rating_per_course)

Average Feedback Rating per Course:
Course_ID
PY202    3.277778
UX303    2.923077
DM101    2.900000
WD404    2.789474
Name: Rating, dtype: float64

5.Is there a correlation between completion rate and feedback rating?

In [ ]:

merged_feedback = pd.merge(course_df, feedback_df, on=['Student_ID', 'Course_ID'])

# Correlation
correlation = merged_feedback[['Completion_Percentage', 'Rating']].corr()
print("Correlation between Completion Rate and Feedback Rating:")
print(correlation)

Correlation between Completion Rate and Feedback Rating:
                       Completion_Percentage    Rating
Completion_Percentage               1.000000 -0.051708
Rating                             -0.051708  1.000000

6.Identify top 3 student segments based on engagement and satisfaction

In [ ]:

# Merge all 3 datasets
merged_all = pd.merge(merged_feedback, students_df, on='Student_ID')

In [57]:
# Merge all 3 datasets: course_activity, feedback, and students
merged_all = pd.merge(merged_feedback, students_df, on='Student_ID')

# Group by student segment (age group + location)
segment_analysis = merged_all.groupby(['Age_Group', 'Location'])[['Time_Spent_Minutes', 'Rating']].mean()

# Score based on both metrics
segment_analysis['Engagement_Satisfaction_Score'] = (
    segment_analysis['Time_Spent_Minutes'].rank(method='min') +
    segment_analysis['Rating'].rank(method='min')
)

# Top 3 segments
top_segments = segment_analysis.sort_values(by='Engagement_Satisfaction_Score', ascending=False).head(3)
print("Top 3 Student Segments (Age Group + Location) by Engagement & Satisfaction:")
print(top_segments)

Top 3 Student Segments (Age Group + Location) by Engagement & Satisfaction:
                     Time_Spent_Minutes    Rating  \
Age_Group Location
<18       Kolkata            113.666667  4.666667
18-25     Bangalore          126.071429  2.642857
          Mumbai             117.333333  3.666667

                     Engagement_Satisfaction_Score
Age_Group Location
<18       Kolkata                             22.0
18-25     Bangalore                           19.0
          Mumbai                              19.0

C:\Users\theja\AppData\Local\Temp\ipykernel_19656\3953840892.py:5: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  segment_analysis = merged_all.groupby(['Age_Group', 'Location'])[['Time_Spent_Minutes', 'Rating']].mean()